package HW_1_2;

public class First {
// Задача №1
//    написать программу, которая будет печатать/выводить следующий текст:
//        3
//        2
//        1
 // Поехали!!!

    public static void main(String[] args) {
        // 1-й вариант
        System.out.println("3\n" +
                "2\n" +
                "1\n" +
                "Поехали!!!\n");
// 2-й вариант
        System.out.println(1);
        System.out.println(2);
        System.out.println(3);
        System.out.println("Поехали!!!");

        // 3-й вариант
        System.out.println("1\n2\n3\nПоехали!!!");
    }
}
